Revit 2027 API
ParameterTypeId.MechanicalEquipmentSetName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MechanicalEquipmentSetName { get; }
Public Shared ReadOnly Property MechanicalEquipmentSetName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MechanicalEquipmentSetName {
	ForgeTypeId^ get ();
}
static member MechanicalEquipmentSetName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace